/*
 Navicat Premium Dump SQL

 Source Server         : PatientApplication
 Source Server Type    : MySQL
 Source Server Version : 80041 (8.0.41)
 Source Host           : localhost:3306
 Source Schema         : hospital

 Target Server Type    : MySQL
 Target Server Version : 80041 (8.0.41)
 File Encoding         : 65001

 Date: 07/01/2026 10:06:07
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for doctor
-- ----------------------------
DROP TABLE IF EXISTS `doctor`;
CREATE TABLE `doctor`  (
  `d_id` int NOT NULL,
  `d_password` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `d_name` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `d_gender` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `d_phone` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `d_card` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `d_email` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `d_post` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `d_introduction` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `d_section` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `d_state` int NOT NULL,
  `d_price` decimal(10, 2) NULL DEFAULT NULL,
  `d_people` int NULL DEFAULT NULL,
  `d_star` decimal(10, 2) NULL DEFAULT NULL,
  `d_avg_star` decimal(10, 2) NULL DEFAULT NULL,
  PRIMARY KEY (`d_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb3 COLLATE = utf8mb3_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of doctor
-- ----------------------------
INSERT INTO `doctor` VALUES (-1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, NULL, NULL, NULL, NULL);
INSERT INTO `doctor` VALUES (201900, '3d7dd7b26500bd0595573b651d0080fd', '刘虎', '女', '18211272779', '440881199701203551', '130794144@qq.com', '副主任医师', '很牛逼', '发热门诊', 1, 12.00, 1, 5.00, 5.00);
INSERT INTO `doctor` VALUES (201901, '3d7dd7b26500bd0595573b651d0080fd', '张敬轩', '男', '18211272779', '440881199701203551', 'hins555ph@163.com', '副主任医师', '忠实践行中医诊疗术法三十多年，能熟练运用中医理论对常见病、疑难病、急慢性疾病施行救治，尤其对咳、喘、胃病、胸痹等有较深心得，调治经带有较好的效果，诊治未病深有体会。', '心血管内科', 1, 32.00, 13, 62.00, 4.77);
INSERT INTO `doctor` VALUES (201902, '3d7dd7b26500bd0595573b651d0080fd', '张柏芝', '男', '18211272779', '440881199701203551', '1092839910@qq.com', '主任医师', '忠实践行中医诊疗术法三十多年，能熟练运用中医理论对常见病、疑难病、急慢性疾病施行救治，尤其对咳、喘、胃病、胸痹等有较深心得，调治经带有较好的效果，诊治未病深有体会。', '消化内科', 1, 12.00, 1, 5.00, 5.00);
INSERT INTO `doctor` VALUES (201903, '3d7dd7b26500bd0595573b651d0080fd', '刘德华', '女', '18211272779', '440881199701203551', '1309283910@qq.com', '副主任医师', '忠实践行中医诊疗术法三十多年，能熟练运用中医理论对常见病、疑难病、急慢性疾病施行救治，尤其对咳、喘、胃病、胸痹等有较深心得，调治经带有较好的效果，诊治未病深有体会。', '心血管内科', 1, 32.00, 2, 9.00, 4.50);
INSERT INTO `doctor` VALUES (201904, '3d7dd7b26500bd0595573b651d0080fd', '张学友', '女', '18211272779', '440881199701203551', '1123092839910@qq.com', '副主任医师', '忠实践行中医诊疗术法三十多年，能熟练运用中医理论对常见病、疑难病、急慢性疾病施行救治，尤其对咳、喘、胃病、胸痹等有较深心得，调治经带有较好的效果，诊治未病深有体会。', '心血管内科', 0, 12.00, 2, 10.00, 5.00);
INSERT INTO `doctor` VALUES (201905, '3d7dd7b26500bd0595573b651d0080fd', '郭富城', '男', '18211272779', '440881199701203551', '12313092839910@qq.com', '主任医师', '忠实践行中医诊疗术法三十多年，能熟练运用中医理论对常见病、疑难病、急慢性疾病施行救治，尤其对咳、喘、胃病、胸痹等有较深心得，调治经带有较好的效果，诊治未病深有体会。', '心血管内科', 1, 42.00, 2, 10.00, 5.00);
INSERT INTO `doctor` VALUES (201906, '3d7dd7b26500bd0595573b651d0080fd', '黎明', '女', '18211272779', '440881199701203551', '1233092839910@qq.com', '副主任医师', '忠实践行中医诊疗术法三十多年，能熟练运用中医理论对常见病、疑难病、急慢性疾病施行救治，尤其对咳、喘、胃病、胸痹等有较深心得，调治经带有较好的效果，诊治未病深有体会。', '心血管内科', 1, 5.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201907, '3d7dd7b26500bd0595573b651d0080fd', '谭雪', '女', '18211272779', '440881199701203551', '4313092839910@qq.com', '主任医师', '忠实践行中医诊疗术法三十多年，能熟练运用中医理论对常见病、疑难病、急慢性疾病施行救治，尤其对咳、喘、胃病、胸痹等有较深心得，调治经带有较好的效果，诊治未病深有体会。', '心血管内科', 1, 32.00, 2, 9.00, 4.50);
INSERT INTO `doctor` VALUES (201908, '3d7dd7b26500bd0595573b651d0080fd', '林彪', '男', '18211272779', '440881199701203551', '43213092839910@qq.com', '主治医生', '忠实践行中医诊疗术法三十多年，能熟练运用中医理论对常见病、疑难病、急慢性疾病施行救治，尤其对咳、喘、胃病、胸痹等有较深心得，调治经带有较好的效果，诊治未病深有体会。', '心血管内科', 1, 43.00, 2, 10.00, 5.00);
INSERT INTO `doctor` VALUES (201909, '3d7dd7b26500bd0595573b651d0080fd', '吴彦祖', '男', '18211272779', '440881199701203551', '64513092839910@qq.com', '副主任医师', '忠实践行中医诊疗术法三十多年，能熟练运用中医理论对常见病、疑难病、急慢性疾病施行救治，尤其对咳、喘、胃病、胸痹等有较深心得，调治经带有较好的效果，诊治未病深有体会。', '妇科', 1, 54.00, 17, 80.00, 4.71);
INSERT INTO `doctor` VALUES (201910, '3d7dd7b26500bd0595573b651d0080fd', '彭于晏', '男', '18211272779', '440881199701203551', '674313092839910@qq.com', '副主任医师', '忠实践行中医诊疗术法三十多年，能熟练运用中医理论对常见病、疑难病、急慢性疾病施行救治，尤其对咳、喘、胃病、胸痹等有较深心得，调治经带有较好的效果，诊治未病深有体会。', '心血管内科', 1, 43.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201911, '3d7dd7b26500bd0595573b651d0080fd', '林峰', '男', '18211272779', '440881199701203551', '7563413092839910@qq.com', '副主任医师', '忠实践行中医诊疗术法三十多年，能熟练运用中医理论对常见病、疑难病、急慢性疾病施行救治，尤其对咳、喘、胃病、胸痹等有较深心得，调治经带有较好的效果，诊治未病深有体会。', '妇科', 1, 32.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201912, '3d7dd7b26500bd0595573b651d0080fd', '张杰', '男', '18211272779', '440881199701203551', '745213092839910@qq.com', '主治医生', '忠实践行中医诊疗术法三十多年，能熟练运用中医理论对常见病、疑难病、急慢性疾病施行救治，尤其对咳、喘、胃病、胸痹等有较深心得，调治经带有较好的效果，诊治未病深有体会。', '心血管内科', 1, 32.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201913, '3d7dd7b26500bd0595573b651d0080fd', '阿达', '男', '18211272779', '440881199701203551', '2525213092839910@qq.com', '主治医生', '忠实践行中医诊疗术法三十多年，能熟练运用中医理论对常见病、疑难病、急慢性疾病施行救治，尤其对咳、喘、胃病、胸痹等有较深心得，调治经带有较好的效果，诊治未病深有体会。', '妇科', 1, 54.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201921, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '130413434@qq.com', '主治医生', '医术高明', '妇科', 1, 13.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201922, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '1304134349@qq.com', '主治医生', '医术高明', '妇科', 1, 14.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201923, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '1304134348@qq.com', '主治医生', '医术高明', '心血管内科', 1, 15.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201924, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '1304134347@qq.com', '主治医生', '医术高明', '心血管内科', 1, 16.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201925, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '1304134346@qq.com', '主治医生', '医术高明', '妇科', 1, 17.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201926, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '1304134345@qq.com', '副主任医师', '医术高明', '妇科', 1, 18.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201927, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '1304134344@qq.com', '副主任医师', '医术高明', '妇科', 1, 19.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201928, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '1304134343@qq.com', '副主任医师', '医术高明', '妇科', 1, 20.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201929, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '1304134342@qq.com', '副主任医师', '医术高明', '妇科', 1, 21.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201930, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '1304134341@qq.com', '副主任医师', '医术高明', '妇科', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201931, '3d7dd7b26500bd0595573b651d0080fd', '蔡晓彤', '男', '18211272779', '550881199701203511', '1313123@qq.com', '主治医生', '医术高明', '妇科', 1, 13.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201932, '3d7dd7b26500bd0595573b651d0080fd', '蔡晓彤', '男', '18211272779', '550881199701203511', '1313124@qq.com', '主治医生', '医术高明', '内分泌科', 1, 14.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201933, '3d7dd7b26500bd0595573b651d0080fd', '蔡晓彤', '男', '18211272779', '550881199701203511', '1313125@qq.com', '主治医生', '医术高明', '内分泌科', 1, 15.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201934, '3d7dd7b26500bd0595573b651d0080fd', '蔡晓彤', '男', '18211272779', '550881199701203511', '1321313@qq.com', '主治医生', '医术高明', '内分泌科', 1, 16.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201935, '3d7dd7b26500bd0595573b651d0080fd', '蔡晓彤', '男', '18211272779', '550881199701203511', '1313127@qq.com', '主治医生', '医术高明', '内分泌科', 1, 17.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201936, '3d7dd7b26500bd0595573b651d0080fd', '蔡晓彤', '男', '18211272779', '550881199701203511', '1313128@qq.com', '主任医师', '医术高明', '消化内科', 1, 18.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201937, '3d7dd7b26500bd0595573b651d0080fd', '蔡晓彤', '男', '18211272779', '550881199701203511', '1313129@qq.com', '主任医师', '医术高明', '消化内科', 1, 19.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201938, '3d7dd7b26500bd0595573b651d0080fd', '蔡晓彤', '男', '18211272779', '550881199701203511', '1313130@qq.com', '主任医师', '医术高明', '消化内科', 1, 20.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201939, '3d7dd7b26500bd0595573b651d0080fd', '蔡晓彤', '男', '18211272779', '550881199701203511', '1313131@qq.com', '主任医师', '医术高明', '消化内科', 1, 21.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201940, '3d7dd7b26500bd0595573b651d0080fd', '蔡晓彤', '男', '18211272779', '550881199701203511', '13131321@qq.com', '主任医师', '医术高明', '消化内科', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201941, '3d7dd7b26500bd0595573b651d0080fd', '陈达', '女', '18211272779', '550881199701203511', '13131332@qq.com', '主治医生', '医术高明', '心血管科', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201942, '3d7dd7b26500bd0595573b651d0080fd', '陈达', '女', '18211272779', '550881199701203511', '131313422@qq.com', '主治医生', '医术高明', '心血管科', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201943, '3d7dd7b26500bd0595573b651d0080fd', '陈达', '女', '18211272779', '550881199701203511', '13131351@qq.com', '主治医生', '医术高明', '心血管科', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201944, '3d7dd7b26500bd0595573b651d0080fd', '陈达', '女', '18211272779', '550881199701203511', '13131326@qq.com', '主治医生', '医术高明', '肾内科', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201945, '3d7dd7b26500bd0595573b651d0080fd', '李现', '女', '18211272779', '550881199701203511', '13133137@qq.com', '主治医生', '医术高明', '肾内科', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201946, '3d7dd7b26500bd0595573b651d0080fd', '李现', '女', '18211272779', '550881199701203511', '131341138@qq.com', '主治医生', '医术高明', '肾内科', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201947, '3d7dd7b26500bd0595573b651d0080fd', '李现', '女', '18211272779', '550881199701203511', '1313312139@qq.com', '主治医生', '医术高明', '发热门诊', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201948, '3d7dd7b26500bd0595573b651d0080fd', '周星驰', '女', '18211272779', '550881199701203511', '131311240@qq.com', '主治医生', '医术高明', '发热门诊', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201949, '3d7dd7b26500bd0595573b651d0080fd', '周星驰', '女', '18211272779', '550881199701203511', '1313232141@qq.com', '副主任医师', '医术高明', '发热门诊', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201950, '3d7dd7b26500bd0595573b651d0080fd', '周星驰', '女', '18211272779', '550881199701203511', '1313233142@qq.com', '副主任医师', '医术高明', '发热门诊', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201951, '3d7dd7b26500bd0595573b651d0080fd', '周星驰', '女', '18211272779', '550881199701203511', '1313132343@qq.com', '副主任医师', '医术高明', '发热门诊', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201952, '3d7dd7b26500bd0595573b651d0080fd', '周线', '女', '18211272779', '550881199701203511', '1313132344@qq.com', '副主任医师', '医术高明', '手足外科', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201953, '3d7dd7b26500bd0595573b651d0080fd', '周线', '女', '18211272779', '550881199701203511', '131543145@qq.com', '副主任医师', '医术高明', '手足外科', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201954, '3d7dd7b26500bd0595573b651d0080fd', '周线', '女', '18211272779', '550881199701203511', '1313453453146@qq.com', '副主任医师', '医术高明', '手足外科', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201955, '3d7dd7b26500bd0595573b651d0080fd', '周线', '女', '18211272779', '550881199701203511', '1354513147@qq.com', '副主任医师', '医术高明', '手足外科', 1, 23.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201956, '3d7dd7b26500bd0595573b651d0080fd', '周线', '女', '18211272779', '550881199701203511', '13153453148@qq.com', '副主任医师', '医术高明', '普通外科', 1, 24.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201957, '3d7dd7b26500bd0595573b651d0080fd', '周线', '女', '18211272779', '550881199701203511', '1313656149@qq.com', '副主任医师', '医术高明', '普通外科', 1, 25.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201958, '3d7dd7b26500bd0595573b651d0080fd', '陈世美', '女', '18211272779', '550881199701203511', '1313132150@qq.com', '副主任医师', '医术高明', '普通外科', 1, 26.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201959, '3d7dd7b26500bd0595573b651d0080fd', '陈世美', '女', '18211272779', '550881199701203511', '13137465151@qq.com', '副主任医师', '医术高明', '肛肠外科', 1, 27.00, 4, 16.00, 4.00);
INSERT INTO `doctor` VALUES (201960, '3d7dd7b26500bd0595573b651d0080fd', '陈世美', '女', '18211272779', '550881199701203511', '143313152@qq.com', '副主任医师', '医术高明', '肛肠外科', 1, 28.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201961, '3d7dd7b26500bd0595573b651d0080fd', '陈世美', '女', '18211272779', '550881199701203511', '1356413153@qq.com', '副主任医师', '医术高明', '肛肠外科', 1, 29.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201962, '3d7dd7b26500bd0595573b651d0080fd', '陈世美', '女', '18211272779', '550881199701203511', '13756413154@qq.com', '副主任医师', '医术高明', '神经外科', 1, 30.00, 1, 5.00, 5.00);
INSERT INTO `doctor` VALUES (201963, '3d7dd7b26500bd0595573b651d0080fd', '刘宪华', '女', '18211272779', '550881199701203511', '1334534513155@qq.com', '副主任医师', '医术高明', '神经外科', 1, 31.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201964, '3d7dd7b26500bd0595573b651d0080fd', '刘宪华', '女', '18211272779', '550881199701203511', '1312313156@qq.com', '副主任医师', '医术高明', '神经外科', 1, 32.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201965, '3d7dd7b26500bd0595573b651d0080fd', '刘宪华', '女', '18211272779', '550881199701203511', '13231213157@qq.com', '副主任医师', '医术高明', '泌尿外科', 1, 33.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201966, '3d7dd7b26500bd0595573b651d0080fd', '刘宪华', '女', '18211272779', '550881199701203511', '1313534158@qq.com', '副主任医师', '医术高明', '泌尿外科', 1, 34.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201967, '3d7dd7b26500bd0595573b651d0080fd', '刘宪华', '女', '18211272779', '550881199701203511', '13136456159@qq.com', '主任医师', '医术高明', '泌尿外科', 1, 35.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201968, '3d7dd7b26500bd0595573b651d0080fd', '刘宪华', '女', '18211272779', '550881199701203511', '13124313160@qq.com', '主任医师', '医术高明', '骨科', 1, 36.00, 1, 5.00, 5.00);
INSERT INTO `doctor` VALUES (201969, '3d7dd7b26500bd0595573b651d0080fd', '钟嘉欣', '女', '18211272779', '550881199701203511', '1313867161@qq.com', '主任医师', '医术高明', '骨科', 1, 37.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201970, '3d7dd7b26500bd0595573b651d0080fd', '钟嘉欣', '女', '18211272779', '550881199701203511', '1313976678162@qq.com', '主任医师', '医术高明', '骨科', 1, 38.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201971, '3d7dd7b26500bd0595573b651d0080fd', '钟嘉欣', '女', '18211272779', '550881199701203511', '13131678163@qq.com', '主任医师', '医术高明', '烧伤整形外科', 1, 39.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201972, '3d7dd7b26500bd0595573b651d0080fd', '钟嘉欣', '女', '18211272779', '550881199701203511', '1313821678164@qq.com', '主任医师', '医术高明', '烧伤整形外科', 1, 40.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201973, '3d7dd7b26500bd0595573b651d0080fd', '钟嘉欣', '男', '18211272779', '550881199701203511', '131313165@qq.com', '主任医师', '医术高明', '烧伤整形外科', 1, 40.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201974, '3d7dd7b26500bd0595573b651d0080fd', '钟嘉欣', '男', '18211272779', '550881199701203511', '131313166@qq.com', '主任医师', '医术高明', '产科', 1, 40.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201975, '3d7dd7b26500bd0595573b651d0080fd', '钟嘉欣', '男', '18211272779', '550881199701203511', '131336167@qq.com', '主任医师', '医术高明', '产科', 1, 40.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201976, '3d7dd7b26500bd0595573b651d0080fd', '钟嘉欣', '男', '18211272779', '550881199701203511', '1908313168@qq.com', '主任医师', '医术高明', '产科', 1, 40.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201977, '3d7dd7b26500bd0595573b651d0080fd', '钟嘉欣', '男', '18211272779', '550881199701203511', '1908313169@qq.com', '主任医师', '医术高明', '儿科', 1, 40.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201978, '3d7dd7b26500bd0595573b651d0080fd', '钟嘉欣', '男', '18211272779', '550881199701203511', '10789313170@qq.com', '主任医师', '医术高明', '儿科', 1, 40.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201979, '3d7dd7b26500bd0595573b651d0080fd', '钟嘉欣', '男', '18211272779', '550881199701203511', '13089013171@qq.com', '主任医师', '医术高明', '儿科', 1, 40.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201980, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '113121@163.com', '副主任医师', '医术高明', '儿童保健科', 1, 40.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201981, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '113121@164.com', '副主任医师', '医术高明', '儿童保健科', 1, 40.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201982, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', 'dsd113121@165.com', '副主任医师', '医术高明', '耳鼻咽喉科', 1, 40.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201983, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '121113121@166.com', '副主任医师', '医术高明', '耳鼻咽喉科', 1, 40.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201984, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '113121@167.com', '副主任医师', '医术高明', '眼科', 1, 12.00, 2, 10.00, 5.00);
INSERT INTO `doctor` VALUES (201985, '3d7dd7b26500bd0595573b651d0080fd', '谢安琪', '女', '18211272779', '550881199701203511', '113121@168.com', '副主任医师', '医术高明', '神经内科', 1, 12.00, 12, 60.00, 5.00);
INSERT INTO `doctor` VALUES (201986, '3d7dd7b26500bd0595573b651d0080fd', '谢安琪', '女', '18211272779', '550881199701203511', '113121@169.com', '副主任医师', '医术高明', '口腔科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201987, '3d7dd7b26500bd0595573b651d0080fd', '谢安琪', '女', '18211272779', '550881199701203511', '113121@170.com', '副主任医师', '医术高明', '口腔科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201988, '3d7dd7b26500bd0595573b651d0080fd', '谢安琪', '女', '18211272779', '550881199701203511', '113121@171.com', '主治医生', '医术高明', '中医科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201989, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '113121@172.com', '主治医生', '医术高明', '中医科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201990, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '113121@173.com', '主治医生', '医术高明', '康复医学科', 1, 12.00, 2, 9.00, 4.50);
INSERT INTO `doctor` VALUES (201991, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '113121@174.com', '主治医生', '医术高明', '康复医学科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201992, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '女', '18211272779', '550881199701203511', '113121@175.com', '主治医生', '医术高明', '急诊科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201993, '3d7dd7b26500bd0595573b651d0080fd', '小熊', '男', '18211272779', '550881199701203511', '113121@176.com', '主治医生', '医术高明', '急诊科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201994, '3d7dd7b26500bd0595573b651d0080fd', '张敬轩', '男', '18211272779', '550881199701203511', '113121@177.com', '主治医生', '医术高明', '急诊科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201995, '3d7dd7b26500bd0595573b651d0080fd', '张敬轩', '男', '18211272779', '550881199701203511', '113121@178.com', '主治医生', '医术高明', '皮肤性病科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201996, '3d7dd7b26500bd0595573b651d0080fd', '张敬轩', '男', '18211272779', '550881199701203511', '113121@179.com', '主治医生', '医术高明', '皮肤性病科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201997, '3d7dd7b26500bd0595573b651d0080fd', '陈柏宇', '男', '18211272779', '550881199701203511', '113121@180.com', '主治医生', '医术高明', '皮肤性病科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201998, '3d7dd7b26500bd0595573b651d0080fd', '陈柏宇', '男', '18211272779', '550881199701203511', '113121@181.com', '主治医生', '医术高明', '功能科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (201999, '3d7dd7b26500bd0595573b651d0080fd', '陈柏宇', '男', '18211272779', '550881199701203511', '113121@181.com', '主治医生', '医术高明', '功能科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202001, '3d7dd7b26500bd0595573b651d0080fd', '陈柏宇', '女', '18211272779', '550881199701203511', '113121@181.com', '主治医生', NULL, '妇科', 1, 21.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202002, '3d7dd7b26500bd0595573b651d0080fd', '陈柏宇', '女', '18211272779', '550881199701203511', '11311121@181.com', '主治医生', NULL, '妇科', 1, 32.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202003, '3d7dd7b26500bd0595573b651d0080fd', '陈柏', '女', '18211272779', '550881199701203511', '11323121@181.com', '主治医生', NULL, '妇科', 1, 43.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202004, '3d7dd7b26500bd0595573b651d0080fd', '柏宇', '女', '18211272779', '550881199701203511', '23113121@181.com', '主治医生', NULL, '妇科', 1, 23.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202005, '3d7dd7b26500bd0595573b651d0080fd', '陈柏宇', '女', '18211272779', '550881199701203511', '43113121@181.com', '主治医生', NULL, '妇科', 1, 22.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202006, '3d7dd7b26500bd0595573b651d0080fd', '陈柏宇', '女', '18211272779', '550881199701203511', '53113121@181.com', '主治医生', NULL, '妇科', 1, 32.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202007, '3d7dd7b26500bd0595573b651d0080fd', '陈柏宇', '女', '18211272779', '550881199701203511', '65113121@181.com', '主治医生', NULL, '妇科', 1, 43.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202008, '3d7dd7b26500bd0595573b651d0080fd', '陈柏宇', '女', '18211272779', '550881199701203511', '131113121@181.com', '主治医生', NULL, '妇科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202009, '3d7dd7b26500bd0595573b651d0080fd', '陈柏宇', '女', '18211272779', '550881199701203511', '113654121@181.com', '主治医生', NULL, '妇科', 1, 43.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202010, '3d7dd7b26500bd0595573b651d0080fd', '陈柏宇', '女', '18211272779', '550881199701203511', '7511343121@181.com', '主治医生', NULL, '妇科', 1, 54.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202011, '3d7dd7b26500bd0595573b651d0080fd', '刘宪华', '男', '18211272779', '550881199701203511', '113125435241@181.com', '主治医生', '医术高明', '妇科', 1, 43.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202012, '3d7dd7b26500bd0595573b651d0080fd', '刘宪华', '男', '18211272779', '550881199701203511', '113524524121@181.com', '主治医生', '医术高明', '妇科', 1, 54.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202013, '3d7dd7b26500bd0595573b651d0080fd', '刘宪华', '男', '18211272779', '550881199701203511', '524524113121@181.com', '主治医生', '医术高明', '妇科', 1, 45.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202014, '3d7dd7b26500bd0595573b651d0080fd', '刘宪华', '男', '18211272779', '550881199701203511', '323113121@181.com', '副主任医师', '医术高明', '妇科', 1, 21.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202015, '3d7dd7b26500bd0595573b651d0080fd', '周深', '男', '18211272779', '550881199701203511', '4343113121@181.com', '副主任医师', '医术高明', '妇科', 1, 43.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202016, '3d7dd7b26500bd0595573b651d0080fd', '周深', '女', '18211272779', '550881199701203511', '5345113121@181.com', '副主任医师', '医术高明', '妇科', 1, 65.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202017, '3d7dd7b26500bd0595573b651d0080fd', '周深', '女', '18211272779', '550881199701203511', 'rwef113121@181.com', '副主任医师', '医术高明', '妇科', 1, 23.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202018, '3d7dd7b26500bd0595573b651d0080fd', '周深', '女', '18211272779', '550881199701203511', '113fadf121@181.com', '副主任医师', '医术高明', '妇科', 1, 54.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202019, '3d7dd7b26500bd0595573b651d0080fd', '周深', '女', '18211272779', '550881199701203511', 'fad113121@181.com', '副主任医师', '医术高明', '妇科', 1, 65.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (202090, 'fa0dbf264c2f14f61e9273fbf2906fc9', '杨晓彤', '男', '18211272779', '550881199701203511', '1313123@qq.com', '主治医生', '医术高明', '产科', 1, 13.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (202091, 'fa0dbf264c2f14f61e9273fbf2906fc9', '谢杰衡', '男', '18211272779', '550881199701203511', '1313124@qq.com', '主治医生', '医术高明', '儿科', 1, 14.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (202092, 'fa0dbf264c2f14f61e9273fbf2906fc9', '陈静娴', '女', '18211272779', '550881199701203511', '1313125@qq.com', '主治医生', '医术高明', '儿科', 1, 15.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (202093, 'fa0dbf264c2f14f61e9273fbf2906fc9', '陈三弟', '男', '18211272779', '550881199701203511', '1321313@qq.com', '主治医生', '医术高明', '产科', 1, 16.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (202094, 'fa0dbf264c2f14f61e9273fbf2906fc9', '蔡晓彤', '女', '18211272779', '550881199701203511', '1313127@qq.com', '主治医生', '医术高明', '内分泌科', 1, 17.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (202095, 'fa0dbf264c2f14f61e9273fbf2906fc9', '杨晓彤', '男', '18211272779', '550881199701203511', '131311123@qq.com', '主治医生', '医术高明', '产科', 1, 13.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (202096, 'fa0dbf264c2f14f61e9273fbf2906fc9', '谢杰衡', '男', '18211272779', '550881199701203511', '131313224@qq.com', '主治医生', '医术高明', '儿科', 1, 14.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (202097, 'fa0dbf264c2f14f61e9273fbf2906fc9', '杨晓彤', '男', '18211272779', '550881199701203511', '138811qa123@qq.com', '主治医生', '医术高明', '产科', 1, 13.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (202098, 'fa0dbf264c2f14f61e9273fbf2906fc9', '谢杰衡', '男', '18211272779', '550881199701203511', '131313hh224@qq.com', '主治医生', '医术高明', '儿科', 1, 14.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (202099, 'fa0dbf264c2f14f61e9273fbf2906fc9', '杨晓彤', '男', '18211272779', '550881199701203511', '138811qa123@qq.com', '主治医生', '医术高明', '产科', 1, 13.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (202301, '3d7dd7b26500bd0595573b651d0080fd', '小白白', '男', '15073171170', '550881199701203511', '3289948684@qq.com', '主任医师', '主任医生', '神经内科', 1, 200.00, 1, 5.00, 5.00);
INSERT INTO `doctor` VALUES (202502, '3d7dd7b26500bd0595573b651d0080fd', '张三', '男', '15615615611', '123456789012345678', '15615615611@qq.com', '主任医师', '小熊专注提供优质源码，访问地址http://code51.cn', '内分泌科', 1, 10.00, 1, 5.00, 5.00);
INSERT INTO `doctor` VALUES (456789, '3d7dd7b26500bd0595573b651d0080fd', '黄明智', '男', '19151800049', '789456123123456789', '3115836016@qq.com', '主任医师', '他很厉害！！！！！！', '神经内科', 1, 1000.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (2019100, 'fa0dbf264c2f14f61e9273fbf2906fc9', '杨晓彤', '男', '18211272779', '550881199701203511', '1313123@qq.com', '主治医生', '医术高明', '产科', 1, 13.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (2019101, 'fa0dbf264c2f14f61e9273fbf2906fc9', '谢杰衡', '男', '18211272779', '550881199701203511', '1313124@qq.com', '主治医生', '医术高明', '儿科', 1, 14.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (2019102, 'fa0dbf264c2f14f61e9273fbf2906fc9', '陈静娴', '女', '18211272779', '550881199701203511', '1313125@qq.com', '主治医生', '医术高明', '儿科', 1, 15.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (2019103, 'fa0dbf264c2f14f61e9273fbf2906fc9', '陈三弟', '男', '18211272779', '550881199701203511', '1321313@qq.com', '主治医生', '医术高明', '产科', 1, 16.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (2019104, 'fa0dbf264c2f14f61e9273fbf2906fc9', '蔡晓彤', '女', '18211272779', '550881199701203511', '1313127@qq.com', '主治医生', '医术高明', '内分泌科', 1, 17.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (2019112, '3d7dd7b26500bd0595573b651d0080fd', '张大幅', '男', '18231311332', '440891381238123', '3123134124@1213.com', '主任医师', '精通医术', '内分泌科', 1, 12.00, 0, 0.00, NULL);
INSERT INTO `doctor` VALUES (2020991, 'fa0dbf264c2f14f61e9273fbf2906fc9', '杨晓彤', '男', '18211272779', '550881199701203511', '138811qa123@qq.com', '主治医生', '医术高明', '产科', 1, 13.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (2020992, 'fa0dbf264c2f14f61e9273fbf2906fc9', '张大枪', '男', '18211272779', '550881199701203511', '138811qa123@qq.com', '主治医生', '医术高明', '产科', 1, 13.00, 0, 0.00, 5.00);
INSERT INTO `doctor` VALUES (2020999, 'fa0dbf264c2f14f61e9273fbf2906fc9', '杨晓彤', '男', '18211272779', '550881199701203511', '138811qa123@qq.com', '主治医生', '医术高明', '产科', 1, 13.00, 0, 0.00, 5.00);

SET FOREIGN_KEY_CHECKS = 1;
